tests/responses/test_winrs_no_cmd_shell.yml

messages:
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:BFDD2899-0570-4071-B453-4D426F6D3330</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To></s:Header><s:Body><rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"><rsp:InputStreams>stdin</rsp:InputStreams><rsp:OutputStreams>stdout stderr</rsp:OutputStreams></rsp:Shell></s:Body></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</a:Action><a:MessageID>uuid:282F4987-8B14-46EF-A198-92304B45548D</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:BFDD2899-0570-4071-B453-4D426F6D3330</a:RelatesTo></s:Header><s:Body><x:ResourceCreated><a:Address>http://192.168.56.11:5985/wsman</a:Address><a:ReferenceParameters><w:ResourceURI>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI><w:SelectorSet><w:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</w:Selector></w:SelectorSet></a:ReferenceParameters></x:ResourceCreated><rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"><rsp:ShellId>8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</rsp:ShellId><rsp:ResourceUri>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</rsp:ResourceUri><rsp:Owner>vagrant</rsp:Owner><rsp:ClientIP>192.168.56.1</rsp:ClientIP><rsp:IdleTimeOut>PT7200.000S</rsp:IdleTimeOut><rsp:InputStreams>stdin</rsp:InputStreams><rsp:OutputStreams>stdout stderr</rsp:OutputStreams><rsp:ShellRunTime>P0DT0H0M0S</rsp:ShellRunTime><rsp:ShellInactivity>P0DT0H0M0S</rsp:ShellInactivity></rsp:Shell></s:Body></s:Envelope>
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:E6A5E944-92EA-43EE-9642-EE506569E1E4</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To><wsman:OptionSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true"><wsman:Option Name="WINRS_SKIP_CMD_SHELL">True</wsman:Option></wsman:OptionSet><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</wsman:Selector></wsman:SelectorSet></s:Header><s:Body><rsp:CommandLine xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"><rsp:Command>powershell.exe</rsp:Command><rsp:Arguments>Write-Host</rsp:Arguments><rsp:Arguments>hi</rsp:Arguments></rsp:CommandLine></s:Body></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.dmtf.org/wbem/wsman/1/wsman/fault</a:Action><a:MessageID>uuid:36DC16C7-3CF9-4FEE-B970-F67A7164E149</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:E6A5E944-92EA-43EE-9642-EE506569E1E4</a:RelatesTo></s:Header><s:Body><s:Fault><s:Code><s:Value>s:Receiver</s:Value><s:Subcode><s:Value>w:InternalError</s:Value></s:Subcode></s:Code><s:Reason><s:Text xml:lang="en-US">The system cannot find the file specified. </s:Text></s:Reason><s:Detail><f:WSManFault xmlns:f="http://schemas.microsoft.com/wbem/wsman/1/wsmanfault" Code="2147942402" Machine="192.168.56.11"><f:Message><f:ProviderFault provider="Shell cmd plugin" path="%systemroot%\system32\winrscmd.dll">The system cannot find the file specified. </f:ProviderFault></f:Message></f:WSManFault></s:Detail></s:Fault></s:Body></s:Envelope>
  transport_error:
    protocol: http
    code: 500
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:BC5B5207-E95A-4C3B-B24D-483487CF16CC</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To><wsman:OptionSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true"><wsman:Option Name="WINRS_SKIP_CMD_SHELL">True</wsman:Option></wsman:OptionSet><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</wsman:Selector></wsman:SelectorSet></s:Header><s:Body><rsp:CommandLine xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"><rsp:Command>C:\Windows\system32\WindowsPowerShell\v1.0\powershell.exe</rsp:Command><rsp:Arguments>Write-Host</rsp:Arguments><rsp:Arguments>hi</rsp:Arguments></rsp:CommandLine></s:Body></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/CommandResponse</a:Action><a:MessageID>uuid:0BF66C43-6087-402D-A767-50A50703413F</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:BC5B5207-E95A-4C3B-B24D-483487CF16CC</a:RelatesTo></s:Header><s:Body><rsp:CommandResponse><rsp:CommandId>B2FF6CD6-CF01-475F-89A0-88ECCE83544D</rsp:CommandId></rsp:CommandResponse></s:Body></s:Envelope>
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Receive</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:8638C388-31FC-4FA2-B271-DA40D7A105BC</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To><wsman:OptionSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true"><wsman:Option Name="WSMAN_CMDSHELL_OPTION_KEEPALIVE">True</wsman:Option></wsman:OptionSet><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</wsman:Selector></wsman:SelectorSet></s:Header><s:Body><rsp:Receive xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"><rsp:DesiredStream CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D">stdout stderr</rsp:DesiredStream></rsp:Receive></s:Body></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/ReceiveResponse</a:Action><a:MessageID>uuid:7B7F8269-9AEC-4E62-B1D1-40B475CDEBCB</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:8638C388-31FC-4FA2-B271-DA40D7A105BC</a:RelatesTo></s:Header><s:Body><rsp:ReceiveResponse><rsp:Stream Name="stdout" CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D">aGk=</rsp:Stream><rsp:Stream Name="stdout" CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D">Cg==</rsp:Stream><rsp:Stream Name="stdout" CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D" End="true"></rsp:Stream><rsp:Stream Name="stderr" CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D" End="true"></rsp:Stream><rsp:CommandState CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D" State="http://schemas.microsoft.com/wbem/wsman/1/windows/shell/CommandState/Done"><rsp:ExitCode>0</rsp:ExitCode></rsp:CommandState></rsp:ReceiveResponse></s:Body></s:Envelope>
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Signal</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:833426F9-2E32-4EB9-9A77-42F45D6CF5F6</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</wsman:Selector></wsman:SelectorSet></s:Header><s:Body><rsp:Signal xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" CommandId="B2FF6CD6-CF01-475F-89A0-88ECCE83544D"><rsp:Code>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/signal/ctrl_c</rsp:Code></rsp:Signal></s:Body></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/SignalResponse</a:Action><a:MessageID>uuid:243E503A-1E59-4AF0-9147-10374E031332</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:833426F9-2E32-4EB9-9A77-42F45D6CF5F6</a:RelatesTo></s:Header><s:Body><rsp:SignalResponse/></s:Body></s:Envelope>
- request: <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Delete</wsa:Action><wsmv:DataLocale xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:Locale xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false" xml:lang="en-US"/><wsman:MaxEnvelopeSize xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">153600</wsman:MaxEnvelopeSize><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">uuid:AD5F92EE-E478-45B6-9404-0188298C4106</wsa:MessageID><wsman:OperationTimeout xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60S</wsman:OperationTimeout><wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsa:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsman:ResourceURI xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</wsman:ResourceURI><wsmv:SessionId xmlns:wsmv="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" s:mustUnderstand="false">uuid:80AEE755-DFAD-42B2-90FF-FBB818A3A017</wsmv:SessionId><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.56.11:5985/wsman</wsa:To><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="ShellId">8463E9B9-1CFF-4A6F-81C0-9F2893F8E04D</wsman:Selector></wsman:SelectorSet></s:Header><s:Body/></s:Envelope>
  response: <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/DeleteResponse</a:Action><a:MessageID>uuid:E4362722-3FEB-43BC-AF8F-1DAC779DB96B</a:MessageID><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To><a:RelatesTo>uuid:AD5F92EE-E478-45B6-9404-0188298C4106</a:RelatesTo></s:Header><s:Body></s:Body></s:Envelope>
